In [1]:
person = {
    'first':'Hussein' , 
    'last':'Sarea',
    'email':'zzzsdsd@dskd.com',
}

In [2]:
people = {
    'first':['Hussein'],
    'last':['Sarea'],
    'email':['zzzsdsd@dskd.com']
}

In [3]:
people = {
    'first':['Hussein' , 'Moataz' , 'Ekram'],
    'last':['Sarea' , 'Ahmed' , 'Sarea'],
    'email':['zzzsdsd@dskd.com' , 'dsd@dsx.com' , 'zzz@dskd.com']
}

In [4]:
people['email']

['zzzsdsd@dskd.com', 'dsd@dsx.com', 'zzz@dskd.com']

In [103]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(people)

In [7]:
df

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com
2    Ekram  Sarea      zzz@dskd.com

In [8]:
df['last']
type(df['last']) #Series

pandas.core.series.Series

In [9]:
df[ ['first' , 'last'] ] #Accessing multiple column , 
type(df[ ['first' , 'last'] ]) #DataFrame

pandas.core.frame.DataFrame

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[0:2 , 2]

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [12]:
df.iloc[ [0 , 1] ] #Selecting multiple rows

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com

In [13]:
df.iloc[ [0 , 1] , 2] #Selecting multiple rows and specific column

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [14]:
df.loc[ [0 , 2] , ['first' , 'email']]

     first             email
0  Hussein  zzzsdsd@dskd.com
2    Ekram      zzz@dskd.com

In [15]:
df['email']

0    zzzsdsd@dskd.com
1         dsd@dsx.com
2        zzz@dskd.com
Name: email, dtype: object

In [16]:
df.set_index('email')

                    first   last
email
zzzsdsd@dskd.com  Hussein  Sarea
dsd@dsx.com        Moataz  Ahmed
zzz@dskd.com        Ekram  Sarea

In [17]:
df.set_index('email' , inplace=True)

In [18]:
df.index

Index(['zzzsdsd@dskd.com', 'dsd@dsx.com', 'zzz@dskd.com'], dtype='object', name='email')

In [19]:
df.loc['zzzsdsd@dskd.com' , 'first']

'Hussein'

In [20]:
df.iloc[0]

first    Hussein
last       Sarea
Name: zzzsdsd@dskd.com, dtype: object

In [21]:
df.reset_index(inplace=True)

In [22]:
df

              email    first   last
0  zzzsdsd@dskd.com  Hussein  Sarea
1       dsd@dsx.com   Moataz  Ahmed
2      zzz@dskd.com    Ekram  Sarea

In [23]:
type(df['last'] == 'Sarea') #Series

pandas.core.series.Series

In [24]:
filt = (df['last'] == 'Sarea')

In [25]:
df[filt]

              email    first   last
0  zzzsdsd@dskd.com  Hussein  Sarea
2      zzz@dskd.com    Ekram  Sarea

In [26]:
type( df.loc[ filt , 'first'] ) #Series
type( df.loc[ filt , ['first' , 'email'] ] ) #DataFrame

df.loc[filt , ['first' , 'email']]

     first             email
0  Hussein  zzzsdsd@dskd.com
2    Ekram      zzz@dskd.com

In [27]:
filt = ( df['first'] == 'Hussein' ) & ( df['last'] == 'Sarea' )
df.loc[filt , 'email']

0    zzzsdsd@dskd.com
Name: email, dtype: object

In [28]:
filt = ( df['first'] == 'Hussein' ) | ( df['last'] == 'Ahmed' )
df.loc[filt , 'email']

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [29]:
filt = ( df['first'] == 'Hussein' ) & ( df['last'] == 'Sarea' )
df.loc[~filt , 'email']

1     dsd@dsx.com
2    zzz@dskd.com
Name: email, dtype: object

In [32]:
df.columns = ['email' , 'first_name' , 'last_name' ]

In [34]:
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [48]:
df.columns = [col.lower() for col in df.columns]
df

              email first_name last_name
0  zzzsdsd@dskd.com    Hussein     Sarea
1       dsd@dsx.com     Moataz     Ahmed
2      zzz@dskd.com      Ekram     Sarea

In [49]:
# df.columns = df.columns.str.replace('_' , ' ')
df

              email first_name last_name
0  zzzsdsd@dskd.com    Hussein     Sarea
1       dsd@dsx.com     Moataz     Ahmed
2      zzz@dskd.com      Ekram     Sarea

In [54]:
df.rename( columns= {
    'first_name' : 'first',
    'last_name' : 'last' ,
} , inplace = True )

In [55]:
df

              email    first   last
0  zzzsdsd@dskd.com  Hussein  Sarea
1       dsd@dsx.com   Moataz  Ahmed
2      zzz@dskd.com    Ekram  Sarea

In [68]:
df.loc[1 , ['email' , 'last']] = ['zzzmmmx@gmail.com' , 'Sarea']
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  Sarea
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [69]:
df.loc[0 , 'email'] = 'zzzssx0@yahoo.com'
df

               email    first   last
0  zzzssx0@yahoo.com  Hussein  Sarea
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [70]:
df.loc[2] = ['ekram@gmail.com' , 'Ekram' , 'Sarea']
df

               email    first   last
0  zzzssx0@yahoo.com  Hussein  Sarea
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [71]:
df.at[0 , 'email'] = 'zzzssx0@gmail.com'
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  Sarea
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [77]:
filt = ( df['first'].str.lower() == 'hussein' )
df[filt]['email']

0    zzzssx0@gmail.com
Name: email, dtype: object

In [79]:
df.loc[filt , 'last'] = 'Ahmed'
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  Ahmed
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [80]:
df['last'] = df['last'].str.lower()
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  ahmed
1  zzzmmmx@gmail.com   Moataz  sarea
2    ekram@gmail.com    Ekram  sarea

In [81]:
df['email'].apply(len)

0    17
1    17
2    15
Name: email, dtype: int64

In [90]:
df['last'] = df['last'].apply(str.title)
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  Ahmed
1  zzzmmmx@gmail.com   Moataz  Sarea
2    ekram@gmail.com    Ekram  Sarea

In [92]:
df['last'] = df['last'].apply(lambda x: x.lower())
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  ahmed
1  zzzmmmx@gmail.com   Moataz  sarea
2    ekram@gmail.com    Ekram  sarea

In [94]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [95]:
len(df['email'])

3

In [101]:
test_df = pd.DataFrame( [[4 , 9]] * 3 , columns=['A' , 'B'] )
test_df

   A  B
0  4  9
1  4  9
2  4  9

In [104]:
test_df.apply(np.sum , axis=0)
# A = 4 + 4 + 4
# B = 9 + 9 + 9

A    12
B    27
dtype: int64

In [106]:
test_df.apply(np.sum , axis=1)
# 0 = 4 + 9
# 1 = 4 + 9
# 2 = 4 + 9

0    13
1    13
2    13
dtype: int64

In [107]:
df.apply(len , axis='columns')

0    3
1    3
2    3
dtype: int64

In [126]:
df.loc[ df['first'] == 'Ekram' , 'email'] = 'zzzp@zmail.com'
df

               email    first   last
0  zzzssx0@gmail.com  Hussein  ahmed
1  zzzmmmx@gmail.com   Moataz  sarea
2     zzzp@zmail.com    Ekram  sarea

In [129]:
df.apply( pd.Series.min , axis=0 )

email    zzzmmmx@gmail.com
first                Ekram
last                 ahmed
dtype: object

In [130]:
df.applymap(len)

   email  first  last
0     17      7     5
1     17      6     5
2     14      5     5

In [133]:
df.applymap(str.lower)

               email    first   last
0  zzzssx0@gmail.com  hussein  ahmed
1  zzzmmmx@gmail.com   moataz  sarea
2     zzzp@zmail.com    ekram  sarea

In [137]:
df['first'].map({
    'Hussein' : 'Ahmed',
    'Ekram' : 'Sis'
})

0    Ahmed
1      NaN
2      Sis
Name: first, dtype: object

In [149]:
test_series = pd.Series([0 , 1 , 2, 3 , 4])
test_series.replace(to_replace=0 , value=100)

0    100
1      1
2      2
3      3
4      4
dtype: int64

In [153]:
test_df = pd.DataFrame( {
    'A' : [0, 1, 2, 3, 4],
    'B' : [5, 6, 7, 8, 0],
    'C' : ['a', 'b', 'c', 'd', 'e']
} )

In [154]:
test_df.replace(0 , 100)

     A    B  C
0  100    5  a
1    1    6  b
2    2    7  c
3    3    8  d
4    4  100  e

In [160]:
test_df.replace([0 , 1 , 'e'] , [10 ,100 , 'x'])

     A   B  C
0   10   5  a
1  100   6  b
2    2   7  c
3    3   8  d
4    4  10  x

In [161]:
test_df.replace([0 , 'a'] , 'x')

   A  B  C
0  x  5  x
1  1  6  b
2  2  7  c
3  3  8  d
4  4  x  e

In [167]:
df['first'].replace({
    'Hussein' : 'Bro',
    'Ekram' : 'Sis'
} , inplace=True)
df

               email   first   last
0  zzzssx0@gmail.com     Bro  ahmed
1  zzzmmmx@gmail.com  Moataz  sarea
2     zzzp@zmail.com     Sis  sarea